名词列表<br>
Routing protocol<br>
路由协议, 由交互信息和算法, 选出到达目标的最佳路径, 添加到路由表. 位于IP层.  如: RIP/OSPF/EIGRP/BGP
<br>
<br>

Routed/Routable protocol<br>
被路由协议和可路由协议, 定义包的结构和逻辑地址, 并允许被路由器转发. 如: IPv4/IPv6
<br>
<br>

IGP(Interior Gateway Protocols, 内部网关协议)<br>
代表机构内部(单个AS内)部署的路由协议. 如: RIP/OSPF/EIGRP/IS-IS等
<br>
<br>

EGP(Exterior Gateway Protocols, 外部网关协议)<br>
代表机构之间(多个AS之间)部署的路由协议. 目前该类只有BGP协议
<br>
<br>
<br>

IGP路由协议算法类型<br>
1.Distance vector<br>
RIP和Cisco IGRP使用该算法,  缺点是收敛速度较慢
<br>

2.Advance distance vector<br>
Cisco EIRGH使用该算法
<br>

3.Link state<br>
OSPF和IS-IS使用该算法, 相较于Distance vector, 会使用额外的CPU和内存资源
<br>
<br>
<br>

路由选择方式:<br>
1.prefix length<br>
优先选择符合的, 并且主机位更短的路由. 示例如下:<br>
10.0.3.0/28、10.0.3.0/26、10.0.3.0/24三个路由, 目标为10.3.0.12<br>
选择10.0.3.0/28作为路由
<br>
<br>

2.administration distance<br>
不同路由类型的判别<br>
AD越小的路由类型, 优先级越高, 该值独立于路由器. 不同路由类型的默认AD值如下:
|路由类型                |AD值                    |
|------------------------|------------------------|
|connected               |0                       |
|static route            |1                       |
|EIGRP(summary route)    |5                       |
|eBGP(external route)    |20                      |
|EIGRP(internal route)   |90                      |
|OSPF                    |110                     |
|IS-IS                   |115                     |
|RIP                     |120                     |
|EIGRP(external route)   |170                     |
|iBGP(internal route)    |200                     |
|Unusable                |255                     |

<br>

3.metric<br>
同一路由类型的判别<br>
RIP使用经过的跳数(路由器)作为测量指标<br>
OSPF使用单条链路的cost作为参考, 并将每条链路的测量汇总作为测量指标
<br>
<br>
<br>

#### OSPF(Open Shortest Path First)
Open Shortest Path First, 开放最短路径优先. 使用协议id 89.<br>
IPv4使用224.0.0.5(AllSPFRouters)/224.0.0.6(AllDRouters)作为多播地址<br>

LSA(link-state advertisements, 链路状态通告): 到达指定链路的信息
<br>

LSDB(link-state database, 链路状态数据库): LSA的集合, 每个Area内的路由器都包含相同的LSDB
<br>
<br>
<br>

###### OSPF包的类型
|Type  |Packet Name   |Functional Overview                    |
|------|--------------|---------------------------------------|
|1     |Hello         |用于发现和维持邻接路由器               |
|2     |Database Description(DBD)|汇总LSDB信息, 用于邻接关系初步形成时|
|3     |Link-state Request(LSR)|用于从邻接路由器获取路由信息  |
|4     |Link-state Update(LSU)|发送路由信息, 用于LSR的响应    |
|5     |Link-state Ack|用于响应LSA泛洪                        |

<br>
<br>

###### 定时器类型
1.Hello Timer<br>
Hello package间隔发送时间
<br>

配置Hello Timer<br>
`(config-if)# ip ospf hello-interval <seconds>`
<br>
<br>

2.Dead Interval Timer<br>
当该时间段内, 没有接收到Hello package时, 认定断开连接. 默认为Hello Timer的4倍
<br>

配置Dead Interval Timer<br>
`(config-if)# ip ospf dead-interval <seconds>`
<br>
<br>

查看Hello/Dead Timer<br>
```
# show ip ospf interface | include Timer|line
FastEthernet0/1 is up, line protocol is up                                      
  Timer intervals configured, Hello 5, Dead 20, Wait 20, Retransmit 5           
FastEthernet0/0 is up, line protocol is up                                      
  Timer intervals configured, Hello 10, Dead 40, Wait 40, Retransmit 5        
```
** 链路两端的Hello/Dead Timer必须一致
<br>
<br>
<br>

###### OSPF步骤
1.位于相同链路, 并且使用OSPF的路由器成为neighbor<br>
![image_not_found](pic/ospf_neighbor.jpg)
<br>

显示OSPF neighbor<br>
`# show ip ospf neighbor`
<br>
<br>

2.neighbor路由器之间交换LSAs<br>
![image_not_found](pic/lsdb_switch.jpg)
<br>

路由器之间进入full state后, 依然需要通过几个步骤, 监测路由拓扑, 步骤如下:<br>
1)在Hello interval间隔时间, 持续发送Hello message; 如果dead interval没有收到neighbor的Hello message, 代表neighbor已经下线
<br>

2)当拓扑发生改变, 离变化最近的路由器接收到LSAs, 向外扩散
<br>

3)即使拓扑没有发生改变, 也会在指定间隔时间(默认30分钟)扩散LSAs
<br>
<br>

Broadcast网络链路(以太网链路默认使用类型)<br>
![image_not_found](pic/DR_elect.jpg)<br>
情景1 - 当R4与其他路由器同时加入OSPF<br>
1)所有路由器刚刚加入OSPF, R4将自己视为DR<br>

2)R4接收到其他路由器发送的Hello packet, 进行如下两步比较:<br>
&emsp;&emsp;I、比较Broadcast域内所有接口的优先级, 优先级最大的成为DR. 当前R4与其它路由器接口的优先级都为默认值, 进入比较步骤II<br>
&emsp;&emsp;II、比较Broadcast域内所有路由器的RID, RID最大的成为DR. 当前R4的RID最大, R4成为DR<br>

3)BDR选举与DR选举类似, R3成为BDR<br>

```
Result:
R4#show ip ospf interface | include Designated.*ID|Router ID                    
  Process ID 1, Router ID 4.4.4.4, Network Type BROADCAST, Cost: 1              
  Designated Router (ID) 4.4.4.4, Interface address 172.16.1.4                  
  Backup Designated router (ID) 3.3.3.3, Interface address 172.16.1.3
```
<br>

情景2 - 当R4在一段时间后加入OSPF(此时R3为DR, R2为BDR)<br>
1)默认情况下, OSPF没有preempt机制, 所有R4加入后的角色为DROther
```
R4#show ip ospf int | include Designated.*ID|Router ID                          
  Process ID 1, Router ID 4.4.4.4, Network Type BROADCAST, Cost: 1              
  Designated Router (ID) 3.3.3.3, Interface address 172.16.1.3                  
  Backup Designated router (ID) 2.2.2.2, Interface address 172.16.1.2
```
<br>

2)清除R3的OSPF process, R3退出DR, BDR(R2)立马接替成为DR, router id最高(R4)的选举成为BDR
```
R3#clear ip ospf process                                                        
Reset ALL OSPF processes? [no]: yes

R4#show ip ospf int | include Designated.*ID|Router ID                          
  Process ID 1, Router ID 4.4.4.4, Network Type BROADCAST, Cost: 1              
  Designated Router (ID) 2.2.2.2, Interface address 172.16.1.2                  
  Backup Designated router (ID) 4.4.4.4, Interface address 172.16.1.4
```
<br>

3)清除R2的OSPF process, R2退出DR, BDR(R4)成为DR, router id最高(R3)的选举成为BDR
```
R2#clear ip ospf process                                                        
Reset ALL OSPF processes? [no]: yes

R4#show ip ospf int | include Designated.*ID|Router ID                          
  Process ID 1, Router ID 4.4.4.4, Network Type BROADCAST, Cost: 1              
  Designated Router (ID) 4.4.4.4, Interface address 172.16.1.4                  
  Backup Designated router (ID) 3.3.3.3, Interface address 172.16.1.3  
```
<br>
<br>

neighbor路由器之间的关系<br>
![image_not_found](pic/neighbor_state.jpg)
<br>

neighbor路由器之间的状态为full state, 称为adjacent neighbot<br>

neighbot路由器之间的状态为2-way state, 称为neighbot<br>

只有adjacent neighbor之间才能直接同步LSDB(通过LSU)
<br>
<br>

协议号和多播地址:<br>
协议号 - 89
<br>

224.0.0.5/01:00:5E:00:00:05<br>
AllSPFRouters - DR/BDR发送内容到其他所有路由器
<br>

224.0.0.6/01:00:5E:00:00:06<br>
AllDRouters - DROther发送内容到DR/BDR路由器
<br>
<br>

子网上所有路由器的Hello interval与Dead interval的值必须一致
<br>
<br>

显示LSDB内容<br>
`# show ip ospf database`
<br>
<br>

3.使用Dijkstra SPF math从LSDB中选取到达指定subnet的最优路径, 将其放入routing table
<br>

观察neighbors关系形成:<br>
`# debug ip ospf adj`
<br>
<br>
<br>

###### 配置OSPF
1.进入router子配置模式, 并指定进程ID<br>
`(config)# router ospf <process_id>`<br>
** process_id在本地唯一, 用于指定进程, 在其他路由器该值不必一致<br>
** 同一台router可以有多个process, 并且每个process有自己唯一的database, 在每个process内的内容只有通过reditribution, 才能被其他process获得
<br>
<br>

2.配置Router ID<br>
`(config-router)# router-id <router-id>`
<br>
** Router ID配置优先级:<br>
1)直接配置<br>
2)从loopback接口中选择ip值最大的<br>
3)从非loopback接口中选择ip值最大的
<br>
<br>

3.接口配置OSPF, 指定所属area<br>
1)在router子配置模式下使用network(旧版本)<br>
`(config-router)# network <subnet_id> <wildcard_mask> area <area_id>`<br>
** subnet_id与wildcard_mask配合, 所有接口IP与该组合相符的, 加入OSPF<br>
** wildcard_mask的0 bit代表接口IP与subnet_id的对应的bit必须一致<br>
** 当wildcard_mask的bit值为1, 但subnet_id对应的bit不为0时, 将该bit置0. 如:192.168.1.2 0.0.0.255, 将192.168.1.2修改为192.168.1.0<br>

2)在接口配置模式下使用ip ospf<br>
`(config-if)# ip ospf <process_id> area <area_id>`
<br>

*4.接口优先级配置<br>
`(config-if)# ip ospf priority <priority>`
<br>
<br>

查看配置OSPF的接口(含Router id)<br>
`# show ip ospf interface [brief]`
<br>
<br>
<br>

##### OSPF特征
1.passive interface<br>
不发送Hello消息, 并且不执行接收的OSPF包<br>

配置passive interface(默认所有接口为非passive)<br>
`(config-router)# passive-interface <interface>`<br>

配置所有接口默认为passive, 并配置非passive接口<br>
```
(config-router)# passive-interface default
(config-router)# no passive-interface <interface>
```
<br>

查看接口是否为passive
```
# show ip ospf interface f0/1 | include Passive
    No Hellos (Passive interface) 
```
<br>

2.OSPF默认路由通告<br>
将默认路由通告给下游路由器, 以上游路由器作为默认路由<br>
当前路由器必须自己包含默认路由<br>

![image_not_found](pic/default_route_advertise.jpg)<br>

配置默认路由通告<br>
```
(config)# router ospf <process_id>
(config-router)# default-information originate [always] [metric <metric_value>] [metric_type <type>]

always
当前路由器没有默认路由, 也向下进行通告
```

```
ISP(config)# interface f0/1
ISP(config-if)# ip address 172.16.1.2 255.255.255.0
ISP(config-if)# no shutdown

R1(config)# interface f0/1
R1(config-if)# ip address 172.16.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config)# interface f0/2
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config)# interface f0/3
R1(config-if)# ip address 192.168.2.1 255.255.255.0
R1(config-if)# no shutdown
R1(config)# router ospf 1
R1(config-router)# router-id 1.1.1.1
R1(config)# interface f0/2
R1(config-if)# ip ospf 1 area 0
R1(config)# interface f0/3
R1(config-if)# ip ospf 1 area 0

R2(config)# interface f0/1
R2(config-if)# ip address 192.168.1.2 255.255.255.0
R2(config-if)# no shutdown
R2(config)# router ospf 1
R2(config-router)# router-id 2.2.2.2
R2(config)# interface f0/1
R2(config-if)# ip ospf 1 area 0

R3(config)# interface f0/1
R3(config-if)# ip address 192.168.2.2 255.255.255.0
R3(config-if)# no shutdown
R3(config)# router ospf 1
R3(config-router)# router-id 3.3.3.3
R3(config)# interface f0/1
R3(config-if)# ip ospf 1 area 0

R2(config)# ip route 0.0.0.0 0.0.0.0 172.16.1.2
R2(config)# router ospf 1
R2(config-router)# default-information originate

R4# show ip route
O*E2  0.0.0.0/0 [110/1] via 192.168.2.1, 00:00:35, FastEthernet0/0
O     192.168.1.0/24 [110/2] via 192.168.2.1, 00:03:49, FastEthernet0/0
      192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.2.0/24 is directly connected, FastEthernet0/0
L        192.168.2.2/32 is directly connected, FastEthernet0/0
```
<br>
<br>

3.OSPF Metrics<br>
计算公式:<br>
$$cost=\frac{reference\ bandwidth}{interface\ bandwidth}$$
** 如公式, reference_bandwidth默认值为100 Mbps, interface_bandwidth与接口speed一致, 结果为小数时, 取整为1
<br>

各种链路默认cost
|interface             |interface bandwidth  |formula             |OSPF cost   |
|----------------------|---------------------|--------------------|------------|
|Serial                |1544 Kbps            |100,000/1544        |64          |
|Ethernet              |10 Mbps              |100,000/10,000      |10          |
|Fast Ethernet         |100 Mbps             |100,000/100,000     |1           |
|Gigabit Ethernet      |1 Gbps               |100,000/1000,000    |1           |
|10 Gigabit Ethernet   |10 Gbps              |100,000/10,000,000  |1           |
|100 Gigabit Ethernet  |100 Gbps             |100,000/100,000,000 |1           |

配置cost方法:<br>
1)直接配置接口cost<br>
`(config-if)# ip ospf cost <num>`
<br>

2)配置reference bandwidth(单位为Mbps)<br>
`(config-router)# auto-cost reference-bandwidth <speed>`<br>
** 建议使用方案, 并且建议所有路由器的reference-bandwidth一致
<br>

3)配置interface bandwidth(单位为Kbps)<br>
`(config-if)# bandwidth <speed>`
<br>
<br>

4.OSPF负载均衡<br>
当多条路径达到子网的cost一致时, 会同时加入routing table, 默认支持4条路径
<br>

配置负载均衡路径数量<br>
`(config-router)# maximum-paths <num>`
<br>
<br>
<br>

##### 链路网络类型<br>
1.broadcast<br>
broadcast multi-access, Ethernet link(Ethernet LAN/WAN)默认使用该类型, 可使用DR/BDR<br>

2.non-broadcast<br>
nonbroadcast multi-access(NBMA), Frame Relay默认使用该类型, 可使用DR/BDR<br>

3.point-to-point<br>
Serial link(HDLC/PPP封装)默认使用该类型, 不可使用DR/BDR<br>

4.point-to-multipoint<br>
没有链路默认使用该类型, 必须手动配置, 不可使用DR/BDR<br>

配置broadcast network type<br>
`(config-if)# ip ospf network {broadcast | non-broadcast | point-to-point | point-to-multipoint}`
<br>
<br>
<br>

OSPF neighbor所需要的条件:
|Requirement       |Required for OSPF|Neighbor Missing if Incorrect|relative command  |
|---------------|-----------------|------------------|------------------|
|Interface must be in an up/up state.|Yes|Yes|show ip interface brief|
|Access control lists(ACL)must not filter routing protocol messages.|Yes|Yes|show access-list|
|Interfaces must be in the same subnet.|Yes|Yes|show ip ospf interface brief|
|They must pass routing protocol neighbor authentication(if configured).|Yes|Yes|show ip ospf interface|
|Hello and hold/dead timers must match.|Yes|Yes|show ip ospf interface|
|Router IDs(RID) must be unique.|Yes|Yes|show ip ospf|
|They must be in the same area.|Yes|Yes|show ip ospf interface brief|
|OSPF process must not be shut down.|Yes|Yes|show ip ospf|
|Neighboring interfaces must use same MTU setting.|Yes|No|show interfaces|
|Neighboring interfaces must use same OSPF network type.|Yes|No|show ip ospf interface|

** Required for OSPF代表是否为成为neighbor路由器正常工作所必须项<br>

** Neighbor Missing if Incorrect代表该项不符时, 是否丢失neighbor关系
<br>
<br>
<br>

#### Area
AS内部可被划分为不同area, 每个area内所有路由器的LSDB内容相同<br>

area在接口级别进行设置, 并且单个接口只能属于一个area<br>

当路由器的多个接口分布在不同area时, 路由器包含有多个LSDB<br>

area 0为骨干area<br>

ABR(Area Border Router)为连接area 0与其他area的路由器, 所有非骨干area必须通过ABR与area 0相连<br>

所有area的路由器都在ABR处进行路由汇总<br>

单个area的路由器建议数量为50个(具体由路由器性能决定)
<br>
<br>
<br>

##### OSPF路由类型
1.area内路由, 路由表显示为O<br>

2.area间路由, 路由表显示为O IA<br>
图1<br>
![image_not_found](pic/ospf_multi_area.jpg)
<br>

示例<br>
如图1, R1的路由如下
```
R1#show ip route
Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 4 subnets
O IA    10.10.1.0 [110/3] via 10.20.1.2, 00:04:03, FastEthernet0/0
O IA    10.30.1.0 [110/4] via 10.20.1.2, 00:02:39, FastEthernet0/0
O       10.20.2.0 [110/2] via 10.20.1.2, 00:08:17, FastEthernet0/0
C       10.20.1.0 is directly connected, FastEthernet0/0
```
<br>
<br>

##### LSA类型
|Type   |Name       |Link State ID             |Advertising Router        |Description         |
|-------|-----------|--------------------------|--------------------------|--------------------|
|1      |Router LSA |生成LSA的路由器的router-id|生成LSA的路由器的router-id|所有路由器都能生成<br>代表指定area内部的active路由器|
|2      |Network LSA|DR的接口IP                |DR的router-id             |由Broadcast/NBMA网络的DR路由器生成<br>代表指定area内部的链路<br>必须由两台或以上路由器组成的链路|
|3      |Summary Network LSA|Network ID        |ABR的router-id            |由ABR生成通告<br>代表其他area通过ABR通告的网络ID|

<br>
<br>

图2<br>
![image_not_found](pic/ospf_interarea_propagation.jpg)<br>

示例 - 如图2, R1的database如下
```
R1#show ip ospf database

            OSPF Router with ID (1.1.1.1) (Process ID 1)

		Router Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum Link count
1.1.1.1         1.1.1.1         105         0x80000002 0x0026C1 1
2.2.2.2         2.2.2.2         142         0x80000004 0x001673 2
3.3.3.3         3.3.3.3         157         0x80000003 0x005E44 2
4.4.4.4         4.4.4.4         146         0x80000003 0x004489 1

		Net Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum
10.20.1.3       3.3.3.3         106         0x80000002 0x00CB23
10.20.2.1       4.4.4.4         146         0x80000001 0x008070

		Summary Net Link States (Area 1)

Link ID         ADV Router      Age         Seq#       Checksum
10.10.1.0       4.4.4.4         276         0x80000001 0x001502
10.30.1.0       4.4.4.4         266         0x80000001 0x002ED3
```
<br>

显示不同LSA类型的database<br>
`# show ip ospf database {router | network | summary}`
<br>

示例 - 如图2, 分开显示LSA 1/2/3
```
R1#show ip ospf database router

            OSPF Router with ID (1.1.1.1) (Process ID 1)

		Router Link States (Area 1)

  LS age: 253
  Options: (No TOS-capability, DC)
  LS Type: Router Links
  Link State ID: 1.1.1.1
  Advertising Router: 1.1.1.1
  LS Seq Number: 80000002
  Checksum: 0x26C1
  Length: 36
  Number of Links: 1

    Link connected to: a Transit Network
     (Link ID) Designated Router address: 10.20.1.3
     (Link Data) Router Interface address: 10.20.1.1
      Number of TOS metrics: 0
       TOS 0 Metrics: 1


  LS age: 290
  Options: (No TOS-capability, DC)
  LS Type: Router Links
  Link State ID: 2.2.2.2
  Advertising Router: 2.2.2.2
  LS Seq Number: 80000004
  Checksum: 0x1673
  Length: 48
  Number of Links: 2
          
    Link connected to: a Transit Network
     (Link ID) Designated Router address: 10.20.2.1
     (Link Data) Router Interface address: 10.20.2.2
      Number of TOS metrics: 0
       TOS 0 Metrics: 1

    Link connected to: a Transit Network
     (Link ID) Designated Router address: 10.20.1.3
     (Link Data) Router Interface address: 10.20.1.2
      Number of TOS metrics: 0
       TOS 0 Metrics: 1
          
          
  LS age: 1391
  Options: (No TOS-capability, DC)
  LS Type: Router Links
  Link State ID: 3.3.3.3
  Advertising Router: 3.3.3.3
  LS Seq Number: 80000003
  Checksum: 0x5E44
  Length: 48
  Number of Links: 2
          
    Link connected to: a Stub Network
     (Link ID) Network/subnet number: 10.20.3.0
     (Link Data) Network Mask: 255.255.255.0
      Number of TOS metrics: 0
       TOS 0 Metrics: 1

    Link connected to: a Transit Network
     (Link ID) Designated Router address: 10.20.1.3
     (Link Data) Router Interface address: 10.20.1.3
      Number of TOS metrics: 0
       TOS 0 Metrics: 1
          
          
  Routing Bit Set on this LSA
  LS age: 1418
  Options: (No TOS-capability, DC)
  LS Type: Router Links
  Link State ID: 4.4.4.4
  Advertising Router: 4.4.4.4
  LS Seq Number: 80000003
  Checksum: 0x4489
  Length: 36
  Area Border Router
  Number of Links: 1
          
    Link connected to: a Transit Network
     (Link ID) Designated Router address: 10.20.2.1
     (Link Data) Router Interface address: 10.20.2.1
      Number of TOS metrics: 0
       TOS 0 Metrics: 1
```
```
R1#show ip ospf database network

            OSPF Router with ID (1.1.1.1) (Process ID 1)

		Net Link States (Area 1)

  Routing Bit Set on this LSA
  LS age: 1437
  Options: (No TOS-capability, DC)
  LS Type: Network Links
  Link State ID: 10.20.1.3 (address of Designated Router)
  Advertising Router: 3.3.3.3
  LS Seq Number: 80000002
  Checksum: 0xCB23
  Length: 36
  Network Mask: /24
	Attached Router: 3.3.3.3
	Attached Router: 1.1.1.1
	Attached Router: 2.2.2.2

  Routing Bit Set on this LSA
  LS age: 1477
  Options: (No TOS-capability, DC)
  LS Type: Network Links
  Link State ID: 10.20.2.1 (address of Designated Router)
  Advertising Router: 4.4.4.4
  LS Seq Number: 80000001
  Checksum: 0x8070
  Length: 32
  Network Mask: /24
        Attached Router: 4.4.4.4
        Attached Router: 2.2.2.2
```
```
R1#show ip ospf database summary

            OSPF Router with ID (1.1.1.1) (Process ID 1)

		Summary Net Link States (Area 1)

  Routing Bit Set on this LSA
  LS age: 1643
  Options: (No TOS-capability, DC, Upward)
  LS Type: Summary Links(Network)
  Link State ID: 10.10.1.0 (summary Network Number)
  Advertising Router: 4.4.4.4
  LS Seq Number: 80000001
  Checksum: 0x1502
  Length: 28
  Network Mask: /24
	TOS: 0 	Metric: 1 

  Routing Bit Set on this LSA
  LS age: 1633
  Options: (No TOS-capability, DC, Upward)
  LS Type: Summary Links(Network)
  Link State ID: 10.30.1.0 (summary Network Number)
  Advertising Router: 4.4.4.4
  LS Seq Number: 80000001
  Checksum: 0x2ED3
  Length: 28
  Network Mask: /24
        TOS: 0 	Metric: 2
```
<br>
<br>

##### OSPF路径选择
1.Intra-area<br>
优先选择area内路由, 如果多条路由都符合, 则比较metric
<br>

2.Interarea<br>
如果多条路由都是area间路由, 则比较metric
<br>
<br>
<br>

##### Area间路由汇总
将非目标Area传播到目标Area(可以是非骨干Area到Area 0方向, 也可以是Area 0到非骨干Area方向)的路由, 在ABR处进行汇总, 以此在非目标Area链路状态发生变化时, 减少目标Area的拓扑变化<br>

汇总路由直接对应到接口Null0<br>

从所有非目标Area匹配的所有网络中, 选取到达ABR Metric最小的网络, 该Metric值作为汇总路由的Metric
<br>
<br>

配置汇总语法<br>
```
(config)# router ospf <process_id>
(config-router)# area <area_id> range <network_id> <subnet_mask> [advertise | not-advertise] [cost <metric>]

area_id
非目标Area的id

network_id/subnet_mask
汇总后的网络ID和掩码

advertise | not-advertise
是否将汇总后的内容进行通告, 默认为advertise

<metric>
手动配置汇总路由的metric. 默认为非目标Area汇总路由所有子集中链路metric最小的metric
```
图3<br>
![image_not_found](pic/ospf_area_summary.jpg)<br>

以下所有示例1/2/3均参考图3<br>
示例1 - 非骨干Area的路由汇总(Type 1 LSA)<br>
情景一<br>
没有进行汇总时, 所有链路正常时, Area 2的Type 1 LSA通过ABR R4进入Area 0, 成为Type 3 LSA
```
R5#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.2.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.2.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 3 
  Link State ID: 10.2.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 64 
  Link State ID: 10.2.4.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 1 
```

情景二<br>
没有进行汇总时, 当R4连接链路10.2.4.0/24的接口出现故障, Area 2的Type 1 LSA通过ABR R4进入Area 0, 成为Type 3 LSA
```
R5#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.2.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 66 
  Link State ID: 10.2.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 65 
  Link State ID: 10.2.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 64 
  Link State ID: 10.2.4.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 67
```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 2的路由(Type 1 LSA)进行汇总, 再通过ABR R4进入Area 0
```
R4(config-router)#area 2 range 10.2.0.0 255.255.248.0

R5#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.2.0.0 (summary Network Number)
  Network Mask: /21
	TOS: 0 	Metric: 1

** 汇总路由的非环路策略, null0接口
R4#show ip route | include 10\.2.*/24|10\.2.*/21
O       10.2.0.0/21 is a summary, 00:04:02, Null0
O       10.2.1.0/24 [110/2] via 10.2.4.2, 00:04:02, FastEthernet1/0
O       10.2.2.0/24 [110/3] via 10.2.4.2, 00:04:02, FastEthernet1/0
C       10.2.3.0/24 is directly connected, Serial2/0
C       10.2.4.0/24 is directly connected, FastEthernet1/0
```

情景四<br>
进行汇总后, 当R4连接链路10.2.4.0/24的接口出现故障, 将Area 2路由(Type 1 LSA)进行汇总, 通过ABR R4进入Area 0
```
R5#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.2.0.0 (summary Network Number)
  Network Mask: /21
	TOS: 0 	Metric: 64
```
<br>

示例2 - Area 0的路由汇总(Type 1 LSA)<br>
情景一<br>
没有进行汇总, 所有链路正常时, Area 0的Type 1 LSA通过ABR R4进入Area 2, 成为Type 3 LSA
```
R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.1.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 1 
  Link State ID: 10.1.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 1 
  Link State ID: 10.1.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
```

情景二<br>
没有进行汇总时, 当R4连接链路10.1.2.0/24的接口出现故障, Area 0的Type 1 LSA通过ABR R4进入Area 2, 成为Type 3 LSA
```
R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.1.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 1 
  Link State ID: 10.1.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 3 
  Link State ID: 10.1.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 0的路由(Type 1 LSA)进行汇总, 再通过ABR R4进入Area 2
```
R4(config-router)#area 0 range 10.1.0.0 255.255.252.0

R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.1.0.0 (summary Network Number)
  Network Mask: /22
	TOS: 0 	Metric: 1

** 汇总路由的非环路策略, null0接口
R4#show ip route | include 10\.1.*/24|10\.1.*/22
O       10.1.3.0/24 [110/2] via 10.1.2.2, 00:01:48, FastEthernet1/1
C       10.1.2.0/24 is directly connected, FastEthernet1/1
C       10.1.1.0/24 is directly connected, FastEthernet1/2
O       10.1.0.0/22 is a summary, 00:01:48, Null0
```

情景四<br>
进行汇总后, 当R4连接链路10.1.2.0/24的接口出现故障, 将Area 0路由(Type 1 LSA)进行汇总, 通过ABR R4进入Area 2
```
R5#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.1.0.0 (summary Network Number)
  Network Mask: /22
	TOS: 0 	Metric: 1
```
<br>

示例3 - Area 0的路由汇总(Type 3 LSA)<br>
情景一<br>
没有进行汇总, 所有链路正常时, Area 0的Type 3 LSA通过ABR R4进入Area 2
```
R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.3.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.3.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.3.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 3
```

情景二<br>
没有进行汇总时, 当R6连接链路10.3.1.0/24的接口出现故障, Area 0的Type 3 LSA通过ABR R4进入Area 2
```
R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.3.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 4 
  Link State ID: 10.3.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.3.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 3
```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 0的路由(Type 3 LSA)进行汇总, 再通过ABR R4进入Area 2
```
R4(config-router)#area 0 range 10.3.0.0 255.255.252.0

R2#show ip ospf database summary | include Link State ID|Network Mask|Metric
  Link State ID: 10.3.1.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.3.2.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 2 
  Link State ID: 10.3.3.0 (summary Network Number)
  Network Mask: /24
	TOS: 0 	Metric: 3
```

结果解析
```
1.由示例1得知, 当在ABR没有进行汇总时, 所有到ABR有链路Metric变化的链路情况, 都会影响到目标Area

当在ABR进行汇总后, 只有汇总路由的Metric(非骨干所有链路最小链路metric)产生变化时, 才会影响目标Area

当静态配置汇总路由的metric, 目标Area不会受到非目标Area链路变化的影响


2.由示例1/2/3得知, 汇总支持Type 1 LSA(非Area 0到Area 0 或 Area 0到非Area 0方向皆可), 但不支持Type 3 LSA汇总
```
<br>
<br>

##### 路由过滤
过滤方式:<br>
1.Type 1 LSA过滤<br>
使用Area间路由汇总语句<br>
`(config-router)# area <area_id> range <networ_id> <subnet_mask> not-advertise`
<br>

示例 - 如图3, 在R4上过滤10.2.2.0/24网络<br>
情景一<br>
过滤10.2.2.0/24之前
```
R5#show ip ospf database summary | include Link State ID 
  Link State ID: 10.2.1.0 (summary Network Number)
  Link State ID: 10.2.2.0 (summary Network Number)
  Link State ID: 10.2.3.0 (summary Network Number)
  Link State ID: 10.2.4.0 (summary Network Number)
  Link State ID: 10.3.1.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)
```

情景二<br>
过滤10.2.2.0/24之后
```
R4(config-router)#area 2 range 10.2.2.0 255.255.255.0 not-advertise

R5#show ip ospf database summary | include Link State ID 
  Link State ID: 10.2.1.0 (summary Network Number)
  Link State ID: 10.2.3.0 (summary Network Number)
  Link State ID: 10.2.4.0 (summary Network Number)
  Link State ID: 10.3.1.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)
```
<br>
<br>

2.Type 1 LSA和Type 3 LSA过滤<br>
配置语法:
```
(config-router)# area <area_id> filter-list prefix <prefix_list_name> {in | out}

area_id配合in/out, 代表从指定area进入/流出
```
<br>

prefix-list内容补充:<br>
配置语法:<br>
```
(config)# ip prefix-list <prefix_list_name> [seq <number>] {deny | permit} <network_id>/<length> [{ge | le} <prefix_length>]

<network_id>/<length>
在指定网络范围内

{ge | le} <prefix_length>
ge(great than and equal)指定最小子网掩码长度
le(less than and equal)指定最大子网掩码长度
```
<br>

示例 - 如图3, 在R4上过滤网络10.3.1.0/24<br>
情景一<br>
过滤10.3.1.0/24之前
```
R2#show ip ospf database summary | include Link State ID
  Link State ID: 10.1.1.0 (summary Network Number)
  Link State ID: 10.1.2.0 (summary Network Number)
  Link State ID: 10.1.3.0 (summary Network Number)
  Link State ID: 10.3.1.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)
```

情景二<br>
过滤10.3.1.0/24之后
```
R4(config)#ip prefix-list OUT_FILTER seq 5 deny 10.3.1.0/24
R4(config)#ip prefix-list OUT_FILTER seq 10 permit 0.0.0.0/0 le 32

R4(config)#router ospf <process_id>
R4(config-router)#area 0 filter-list prefix OUT_FILTER out

R2#show ip ospf database summary | include Link State ID
  Link State ID: 10.1.1.0 (summary Network Number)
  Link State ID: 10.1.2.0 (summary Network Number)
  Link State ID: 10.1.3.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)
```
<br>
<br>

3.不将Type 1 LSA或Type 3 LSA安装到本机路由表(RIB), 并且不影响在路由器间的传播<br>
配置语法
```
(config-router)# distribute-list {<acl_number> | <acl_name> | prefix <prefix_list_name> | route-map <route_map_name>} in
```

示例 - 如图3, 配置R4不安装10.2.1.0/24到RIB<br>
```
配置前:
R4#show ip route | begin Gateway
Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 10 subnets
O IA    10.3.1.0 [110/2] via 10.1.1.2, 00:19:57, FastEthernet1/0
O       10.1.3.0 [110/2] via 10.1.2.2, 00:19:57, FastEthernet0/1
                 [110/2] via 10.1.1.2, 00:19:57, FastEthernet1/0
O       10.2.1.0 [110/2] via 10.2.4.2, 00:19:57, FastEthernet0/0
C       10.1.2.0 is directly connected, FastEthernet0/1
O IA    10.3.3.0 [110/3] via 10.1.1.2, 00:19:57, FastEthernet1/0
O       10.2.2.0 [110/3] via 10.2.4.2, 00:19:57, FastEthernet0/0
C       10.1.1.0 is directly connected, FastEthernet1/0
O IA    10.3.2.0 [110/2] via 10.1.1.2, 00:19:57, FastEthernet1/0
C       10.2.3.0 is directly connected, Serial3/0
C       10.2.4.0 is directly connected, FastEthernet0/0


配置后:
R4(config)#ip prefix-list RIB_FILTER seq 5 deny 10.2.1.0/24
R4(config)#ip prefix-list RIB_FILTER seq 10 permit 0.0.0.0/0 le 32

R4(config)#router ospf <process_id>
R4(config-router)#distribute-list prefix RIB_FILTER in

R4#show ip route | begin Gateway
Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 9 subnets
O IA    10.3.1.0 [110/2] via 10.1.1.2, 00:00:11, FastEthernet1/0
O       10.1.3.0 [110/2] via 10.1.2.2, 00:00:11, FastEthernet0/1
                 [110/2] via 10.1.1.2, 00:00:11, FastEthernet1/0
C       10.1.2.0 is directly connected, FastEthernet0/1
O IA    10.3.3.0 [110/3] via 10.1.1.2, 00:00:11, FastEthernet1/0
O       10.2.2.0 [110/3] via 10.2.4.2, 00:00:11, FastEthernet0/0
C       10.1.1.0 is directly connected, FastEthernet1/0
O IA    10.3.2.0 [110/2] via 10.1.1.2, 00:00:11, FastEthernet1/0
C       10.2.3.0 is directly connected, Serial3/0
C       10.2.4.0 is directly connected, FastEthernet0/0

R4#show ip ospf database summary | include Link State ID
  Link State ID: 10.2.1.0 (summary Network Number)
  Link State ID: 10.2.2.0 (summary Network Number)
  Link State ID: 10.2.3.0 (summary Network Number)
  Link State ID: 10.2.4.0 (summary Network Number)
  Link State ID: 10.3.1.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)
  Link State ID: 10.1.1.0 (summary Network Number)
  Link State ID: 10.1.2.0 (summary Network Number)
  Link State ID: 10.1.3.0 (summary Network Number)
  Link State ID: 10.3.1.0 (summary Network Number)
  Link State ID: 10.3.2.0 (summary Network Number)
  Link State ID: 10.3.3.0 (summary Network Number)

R5#show ip route | begin Gateway
Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 10 subnets
O IA    10.3.1.0 [110/2] via 10.1.3.2, 00:43:10, FastEthernet0/1
C       10.1.3.0 is directly connected, FastEthernet0/1
O IA    10.2.1.0 [110/3] via 10.1.2.1, 00:47:15, FastEthernet0/0
C       10.1.2.0 is directly connected, FastEthernet0/0
O IA    10.3.3.0 [110/3] via 10.1.3.2, 00:52:20, FastEthernet0/1
O IA    10.2.2.0 [110/4] via 10.1.2.1, 00:25:53, FastEthernet0/0
O       10.1.1.0 [110/2] via 10.1.3.2, 00:52:10, FastEthernet0/1
                 [110/2] via 10.1.2.1, 00:49:47, FastEthernet0/0
O IA    10.3.2.0 [110/2] via 10.1.3.2, 00:52:20, FastEthernet0/1
O IA    10.2.3.0 [110/65] via 10.1.2.1, 00:48:25, FastEthernet0/0
O IA    10.2.4.0 [110/2] via 10.1.2.1, 00:49:47, FastEthernet0/0
```
<br>
<br>

ASBR(Autonomous System Boundary Router)<br>
OSPF与其他路由协议的边界, 即该路由器的一部分接口属于OSPF, 一部分接口属于其他路由协议.<br>

当其他路由协议redistribute到OSPF domain时, OSPF划分两种类型:<br>
Type 1<br>
metric = redistribute metric + OSPF metric<br>

Type 2(默认类型)<br>
metric = redistribute metric(30 hops内)
<br>
<br>
<br>

#### OSPFv3
OSPFv3特性<br>
1.同时支持IPv4和IPv6<br>

2.IPv6使用link local地址作为构建邻接关系的地址<br>

3.Router ID在只使用IPv6的情况必须手动配置
<br>
<br>

协议号和多播地址:<br>
协议号 - 89<br>

FF02::05 - ALLSPFRouters<br>

FF02::06 - ALLDRouters
<br>
<br>

###### OSPFv3包的类型
|Type  |Packet Name   |Functional Overview                    |
|------|--------------|---------------------------------------|
|1     |Hello         |用于发现和维持邻接路由器               |
|2     |Database Description(DBD)|汇总LSDB信息, 用于邻接关系初步形成时|
|3     |Link-state Request(LSR)|用于从邻接路由器获取路由信息  |
|4     |Link-state Update(LSU)|发送路由信息, 用于LSR的响应    |
|5     |Link-state Ack|用于响应LSA泛洪                        |

<br>
<br>

OSPFv3的IPv6配置步骤:<br>
1.开启ipv6路由<br>
`(config)# ipv6 unicast-routing`
<br>

2.创建ospfv3进程<br>
`(config)# router ospfv3 <process_id>`
<br>

3.指定Router ID<br>
`(config-router)# router-id <router_id>`
<br>

4.接口上启动ospfv3<br>
`(config-if)# ospfv3 <process_id> ipv6 area <area_id>`
<br>
<br>

OSPFv3邻接路由器查看<br>
`# show ospfv3 ipv6 neighbor`
<br>
<br>

OSPFv3接口信息<br>
`# show ospfv3 interface <interface_type> <interface_num>`
<br>
<br>

OSPFv3接口简略信息<br>
`# show ospfv3 interface brief`
<br>
<br>

图4<br>
![image_not_found](pic/ospfv3_multi_area.jpg)<br>

示例 - 如图4, 配置代码
```
R1(config)#ipv6 unicast-routing
R1(config)#router ospfv3 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#int f0/0
R1(config-if)#ipv6 add 2001:db8:1::1/64
R1(config-if)#no shutdown
R1(config-if)#ospfv3 1 ipv6 area 0

R2(config)#ipv6 unicast-routing
R2(config)#router ospfv3 1
R2(config-router)#router-id 2.2.2.2
R2(config-router)#int f0/0
R2(config-if)#ipv6 add 2001:db8:1::2/64
R2(config-if)#no shutdown
R2(config-if)#ospfv3 1 ipv6 area 0
R2(config-if)#int f0/1
R2(config-if)#ipv6 add 2001:db8:2::2/64
R2(config-if)#no shutdown
R2(config-if)#ospfv3 1 ipv6 area 0

R3(config)#ipv6 unicast-routing
R3(config)#router ospfv3 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#int f0/0
R3(config-if)#ipv6 add 2001:db8:2::1/64
R3(config-if)#no shutdown
R3(config-if)#ospfv3 1 ipv6 area 0
R3(config-if)#int f0/1
R3(config-if)#ipv6 add 2001:db8:3::1/64
R3(config-if)#no shutdown
R3(config-if)#ospfv3 1 ipv6 area 1

R4(config)#ipv6 unicast-routing 
R4(config)#router ospfv3 1
R4(config-router)#router-id 4.4.4.4
R4(config-router)#int f0/0
R4(config-if)#ipv6 add 2001:db8:3::2/64
R4(config-if)#no shutdown
R4(config-if)#ospfv3 1 ipv6 area 1


R3# show ospfv3 ipv6 neighbor

          OSPFv3 1 address-family ipv6 (router-id 3.3.3.3)

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
2.2.2.2           1   FULL/DR         00:00:31    4               FastEthernet0/0
4.4.4.4           1   FULL/BDR        00:00:37    3               FastEthernet0/1


R3# show ospfv3 interface f0/0
FastEthernet0/0 is up, line protocol is up 
  Link Local Address FE80::C803:5FF:FED3:8, Interface ID 3
  Area 0, Process ID 1, Instance ID 0, Router ID 3.3.3.3
  Network Type BROADCAST, Cost: 1
  Transmit Delay is 1 sec, State BDR, Priority 1
  Designated Router (ID) 2.2.2.2, local address FE80::C802:5FF:FEA4:6
  Backup Designated router (ID) 3.3.3.3, local address FE80::C803:5FF:FED3:8
  Timer intervals configured, Hello 10, Dead 40, Wait 40, Retransmit 5
    Hello due in 00:00:04
  Graceful restart helper support enabled
  Index 1/1/1, flood queue length 0
  Next 0x0(0)/0x0(0)/0x0(0)
  Last flood scan length is 1, maximum is 1
  Last flood scan time is 0 msec, maximum is 0 msec
  Neighbor Count is 1, Adjacent neighbor count is 1 
    Adjacent with neighbor 2.2.2.2  (Designated Router)
  Suppress hello for 0 neighbor(s)


R3# show ospfv3 interface brief
Interface    PID   Area            AF         Cost  State Nbrs F/C
Fa0/0        1     0               ipv6       1     BDR   1/1
Fa0/1        1     1               ipv6       1     DR    1/1


R4#show ipv6 route ospf
OI  2001:DB8:1::/64 [110/3]
     via FE80::C803:5FF:FED3:6, FastEthernet0/0
OI  2001:DB8:2::/64 [110/2]
     via FE80::C803:5FF:FED3:6, FastEthernet0/0
```
<br>
<br>

##### OSPFv3特征
###### 1.Passive Interface
不发送Hello消息, 并且不执行接收的OSPF包<br>

配置passive interface(默认所有接口为非passive)<br>
`(config-router)# passive-interface <interface>`<br>

配置所有接口默认为passive, 并配置非passive接口<br>
```
(config-router)# passive-interface default
(config-router)# no passive-interface <interface>
```
<br>

查看接口是否为passive
```
R3# show ospfv3 interface f0/0 | include Passive
    No Hellos (Passive interface) 
```
<br>
<br>

###### 2.Network Type
配置接口类型:<br>
`(config-if)# ospfv3 network {broadcast | point-to-point}`
<br>
<br>

查看接口类型:<br>
`# show ospfv3 interface <interface_type> <interface_num> | include Network`
<br>
<br>
<br>

###### 3.OSPFv6的IPV6与IPv4双通道
OSPFv3的双通道配置步骤:<br>
1.开启ipv6路由<br>
`(config)# ipv6 unicast-routing`
<br>

2.创建ospfv3进程<br>
`(config)# router ospfv3 <process_id>`
<br>

3.指定Router ID<br>
`(config-router)# router-id <router_id>`
<br>

4.接口上启动ospfv3<br>
```
(config-if)# ospfv3 <process_id> ipv6 area <area_id>
(config-if)# ospfv3 <process_id> ipv4 area <area_id>
```
<br>
<br>

###### 4.Area间路由汇总
配置汇总
```
(config)# router ospf <process_id>
(config-router)# address-family ipv6 unicast
(config-router-af)# area <area_id> range <prefix>/<prefix_length> [advertise | not-advertise] [cost <metric>]
```

图5<br>
![image_not_found](pic/ospfv3_area_summary.jpg)<br>

以下所有示例1/2/3均参考图3<br>
示例1 - 非骨干Area的路由汇总(Type 1 LSA)<br>
情景一<br>
没有进行汇总时, 所有链路正常时, Area 2的Type 1 LSA通过ABR R4进入Area 0, 成为Type 3 LSA
```
R5#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 1 
  Prefix Address: 2001:DB8:2:4::
  Prefix Length: 64, Options: None
  Metric: 64 
  Prefix Address: 2001:DB8:2:3::
  Prefix Length: 64, Options: None
  Metric: 3 
  Prefix Address: 2001:DB8:2:2::
  Prefix Length: 64, Options: None
  Metric: 2 
  Prefix Address: 2001:DB8:2:1::
  Prefix Length: 64, Options: None
```

情景二<br>
没有进行汇总时, 当R4连接链路2001:db8:2:4::/64的接口出现故障, Area 2的Type 1 LSA通过ABR R4进入Area 0, 成为Type 3 LSA
```
R5#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 64 
  Prefix Address: 2001:DB8:2:3::
  Prefix Length: 64, Options: None
  Metric: 65 
  Prefix Address: 2001:DB8:2:2::
  Prefix Length: 64, Options: None
  Metric: 66 
  Prefix Address: 2001:DB8:2:1::
  Prefix Length: 64, Options: None
  Metric: 67 
  Prefix Address: 2001:DB8:2:4::
  Prefix Length: 64, Options: None
```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 2的路由(Type 1 LSA)进行汇总, 再通过ABR R4进入Area 0
```
R4(config-router)# address-family ipv6 unicast
R4(config-router-af)#area 2 range 2001:db8:2:0::/61

R5#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 67 
  Prefix Address: 2001:DB8:2::
  Prefix Length: 61, Options: None

** 汇总路由的非环路策略, null0接口
R4#show ipv6 route | section DB8:2.*/64|DB8:2.*/61
O   2001:DB8:2::/61 [110/67]
     via Null0, directly connected
O   2001:DB8:2:1::/64 [110/2]
     via FE80::C802:9FF:FE1A:6, FastEthernet0/0
O   2001:DB8:2:2::/64 [110/3]
     via FE80::C802:9FF:FE1A:6, FastEthernet0/0
C   2001:DB8:2:3::/64 [0/0]
     via Serial2/0, directly connected
C   2001:DB8:2:4::/64 [0/0]
     via FastEthernet0/0, directly connected
```

情景四<br>
进行汇总后, 当R4连接链路2001:bd8:2:4::/64的接口出现故障, 将Area 2路由(Type 1 LSA)进行汇总, 通过ABR R4进入Area 0
```
R5#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 128 
  Prefix Address: 2001:DB8:2::
  Prefix Length: 61, Options: None
```
<br>

示例2 - Area 0的路由汇总(Type 1 LSA)<br>
情景一<br>
没有进行汇总, 所有链路正常时, Area 0的Type 1 LSA通过ABR R4进入Area 2, 成为Type 3 LSA
```
R2#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 2 
  Prefix Address: 2001:DB8:1:3::
  Prefix Length: 64, Options: None
  Metric: 1 
  Prefix Address: 2001:DB8:1:1::
  Prefix Length: 64, Options: None
  Metric: 1 
  Prefix Address: 2001:DB8:1:2::
  Prefix Length: 64, Options: None

```

情景二<br>
没有进行汇总时, 当R4连接链路2001:db8:1:2::/64的接口出现故障, Area 0的Type 1 LSA通过ABR R4进入Area 2, 成为Type 3 LSA
```
R2#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 2 
  Prefix Address: 2001:DB8:1:3::
  Prefix Length: 64, Options: None
  Metric: 1 
  Prefix Address: 2001:DB8:1:1::
  Prefix Length: 64, Options: None
  Metric: 3 
  Prefix Address: 2001:DB8:1:2::
  Prefix Length: 64, Options: None
```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 0的路由(Type 1 LSA)进行汇总, 再通过ABR R4进入Area 2
```
R4(config-router)#address-family ipv6 unicast 
R4(config-router-af)#area 0 range 2001:db8:1::/62

R2#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 2 
  Prefix Address: 2001:DB8:1::
  Prefix Length: 62, Options: None

** 汇总路由的非环路策略, null0接口
R4#show ipv6 route | section DB8:1.*/64|DB8:1.*/62
O   2001:DB8:1::/62 [110/2]
     via Null0, directly connected
C   2001:DB8:1:1::/64 [0/0]
     via FastEthernet1/0, directly connected
C   2001:DB8:1:2::/64 [0/0]
     via FastEthernet0/1, directly connected
O   2001:DB8:1:3::/64 [110/2]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
     via FE80::C805:9FF:FEAE:8, FastEthernet0/1
```

情景四<br>
进行汇总后, 当R4连接链路2001:db8:1:2::/64的接口出现故障, 将Area 0路由(Type 1 LSA)进行汇总, 通过ABR R4进入Area 2
```
R2#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 3 
  Prefix Address: 2001:DB8:1::
  Prefix Length: 62, Options: None
```
<br>

示例3 - Area 0的路由汇总(Type 3 LSA)<br>
情景一<br>
没有进行汇总, 所有链路正常时, Area 0的Type 3 LSA通过ABR R4进入Area 2
```
R2#show ipv6 ospf database inter-area prefix | include Metric|Prefix.*:
  Metric: 2 
  Prefix Address: 2001:DB8:3:1::
  Prefix Length: 64, Options: None
  Metric: 2 
  Prefix Address: 2001:DB8:3:2::
  Prefix Length: 64, Options: None
  Metric: 3 
  Prefix Address: 2001:DB8:3:3::
  Prefix Length: 64, Options: None

```

情景二<br>
没有进行汇总时, 当R6连接链路2001:db8:3:1::/64的接口出现故障, Area 0的Type 3 LSA通过ABR R4进入Area 2
```
  Metric: 4 
  Prefix Address: 2001:DB8:3:1::
  Prefix Length: 64, Options: None
  Metric: 2 
  Prefix Address: 2001:DB8:3:2::
  Prefix Length: 64, Options: None
  Metric: 3 
  Prefix Address: 2001:DB8:3:3::
  Prefix Length: 64, Options: None

```

情景三<br>
进行汇总后, 所有链路正常时, 将Area 0的路由(Type 3 LSA)进行汇总, 再通过ABR R4进入Area 2
```
R4(config-router)#address-family ipv6 unicast 
R4(config-router-af)#area 0 range 2001:db8:3::/62

  Metric: 2 
  Prefix Address: 2001:DB8:3:1::
  Prefix Length: 64, Options: None
  Metric: 2 
  Prefix Address: 2001:DB8:3:2::
  Prefix Length: 64, Options: None
  Metric: 3 
  Prefix Address: 2001:DB8:3:3::
  Prefix Length: 64, Options: None
```
<br>
<br>

###### 5.路由过滤
过滤方式:
1.Type 1 LSA过滤
使用Area间路由汇总语句
`(config-router-af)# area <area_id> range <prefix>/<prefix-length> not-advertise`
<br>

示例 - 如图5, 在R4上过滤2001:db8:2:2::/64网络<br>
情景一<br>
过滤之前
```
R5#show ipv6 ospf database inter-area prefix | include Prefix Address
  Prefix Address: 2001:DB8:2:4::
  Prefix Address: 2001:DB8:2:3::
  Prefix Address: 2001:DB8:2:2::
  Prefix Address: 2001:DB8:2:1::
  Prefix Address: 2001:DB8:3:3::
  Prefix Address: 2001:DB8:3:2::
  Prefix Address: 2001:DB8:3:1::

```

情景二
```
R4(config-router)# address-family ipv6 unicast
R4(config-router-af)# area 2 range 2001:db8:2:2::/64 not-advertise

R5# show ipv6 ospf database inter-area prefix | include Prefix Address
  Prefix Address: 2001:DB8:2:4::
  Prefix Address: 2001:DB8:2:3::
  Prefix Address: 2001:DB8:2:1::
  Prefix Address: 2001:DB8:3:3::
  Prefix Address: 2001:DB8:3:2::
  Prefix Address: 2001:DB8:3:1::
```
<br>
<br>

2.Type 1 LSA和Type 3 LSA过滤
配置语法:
```
(config-router)# address-family ipv6 unicast
(config-router-af)# area <area_id> filter-list prefix <prefix_list_name> {in | out}

area_id配合in/out, 代表从指定area进入/流出
```
<br>

示例 - 如图5, 在R4上过滤网络2001;db8:3:1::/64<br>
情景一<br>
过滤之前
```
R2# show ipv6 ospf database inter-area prefix | include Prefix Address
  Prefix Address: 2001:DB8:1:3::
  Prefix Address: 2001:DB8:1:1::
  Prefix Address: 2001:DB8:1:2::
  Prefix Address: 2001:DB8:3:1::
  Prefix Address: 2001:DB8:3:2::
  Prefix Address: 2001:DB8:3:3::
```

情景二
过滤之后
```
R4(config)# ipv6 prefix-list OUT_FILTER seq 5 deny 2001:db8:3:1::/64
R4(config)# ipv6 prefix-list OUT_FILTER seq 10 permit ::/0 le 128

R4(config)# router ospfv3 1
R4(config-router)# address-family ipv6 unicast
R4(config-router-af)# area 0 filter-list prefix OUT_FILTER out

R2#show ipv6 ospf database inter-area prefix | include Prefix Address
  Prefix Address: 2001:DB8:1:3::
  Prefix Address: 2001:DB8:1:1::
  Prefix Address: 2001:DB8:1:2::
  Prefix Address: 2001:DB8:3:2::
  Prefix Address: 2001:DB8:3:3::
```
<br>
<br>

3.不将Type 1 LSA或Type 3 LSA安装到本机路由表(RIB), 并且不影响在路由器间的传播
配置语法
```
(config)# router ospfv3 <process_id>
(config-router)# address-family ipv6 unicast
(config-router-af)# distribute-list {<acl_number> | <acl_name> | prefix <prefix_list_name> | route-map <route_map_name>} in
```
<br>

示例 - 如图5, 配置R4不安装2001:db8:2:1::/64到RIB
```
配置前:
R4# show ipv6 route
C   2001:DB8:1:1::/64 [0/0]
     via FastEthernet1/0, directly connected
L   2001:DB8:1:1::1/128 [0/0]
     via FastEthernet1/0, receive
C   2001:DB8:1:2::/64 [0/0]
     via FastEthernet0/1, directly connected
L   2001:DB8:1:2::1/128 [0/0]
     via FastEthernet0/1, receive
O   2001:DB8:1:3::/64 [110/2]
     via FE80::C805:9FF:FEAE:8, FastEthernet0/1
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
O   2001:DB8:2:1::/64 [110/2]
     via FE80::C802:9FF:FE1A:6, FastEthernet0/0
O   2001:DB8:2:2::/64 [110/3]
     via FE80::C802:9FF:FE1A:6, FastEthernet0/0
C   2001:DB8:2:3::/64 [0/0]
     via Serial2/0, directly connected
L   2001:DB8:2:3::1/128 [0/0]
     via Serial2/0, receive
C   2001:DB8:2:4::/64 [0/0]
     via FastEthernet0/0, directly connected
L   2001:DB8:2:4::1/128 [0/0]
     via FastEthernet0/0, receive
OI  2001:DB8:3:1::/64 [110/2]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
OI  2001:DB8:3:2::/64 [110/2]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
OI  2001:DB8:3:3::/64 [110/3]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
L   FF00::/8 [0/0]
     via Null0, receive


配置后:
R4(config)#ipv6 prefix-list RIB_FILTER seq 5 deny 2001:db8:2:1::/64
R4(config)#ipv6 prefix-list RIB_FILTER seq 10 permit ::/0 le 128
R4(config)#router ospfv3 1
R4(config-router)#address-family ipv6 unicast
R4(config-router-af)#distribute-list prefix RIB_FILTER in

R4# show ipv6 route
C   2001:DB8:1:1::/64 [0/0]
     via FastEthernet1/0, directly connected
L   2001:DB8:1:1::1/128 [0/0]
     via FastEthernet1/0, receive
C   2001:DB8:1:2::/64 [0/0]
     via FastEthernet0/1, directly connected
L   2001:DB8:1:2::1/128 [0/0]
     via FastEthernet0/1, receive
O   2001:DB8:1:3::/64 [110/2]
     via FE80::C805:9FF:FEAE:8, FastEthernet0/1
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
O   2001:DB8:2:2::/64 [110/3]
     via FE80::C802:9FF:FE1A:6, FastEthernet0/0
C   2001:DB8:2:3::/64 [0/0]
     via Serial2/0, directly connected
L   2001:DB8:2:3::1/128 [0/0]
     via Serial2/0, receive
C   2001:DB8:2:4::/64 [0/0]
     via FastEthernet0/0, directly connected
L   2001:DB8:2:4::1/128 [0/0]
     via FastEthernet0/0, receive
OI  2001:DB8:3:1::/64 [110/2]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
OI  2001:DB8:3:2::/64 [110/2]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
OI  2001:DB8:3:3::/64 [110/3]
     via FE80::C806:9FF:FECE:8, FastEthernet1/0
L   FF00::/8 [0/0]
     via Null0, receive
```
<br>
<br>

引用:<br>
[1] OSPFv2 RFC: https://datatracker.ietf.org/doc/html/rfc2328
